spec/fixtures/vcr_cassettes/campaign_performance_report/with_successful_status.yml

---
http_interactions:
- request:
    method: post
    uri: https://login.live.com/oauth20_token.srf
    body:
      encoding: UTF-8
      string: client_id=bing-ads-oauth-client-id&client_secret=bing-ads-oauth-client-secret&grant_type=refresh_token&refresh_token=bing-ads-oauth-refresh-token
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-store
      Pragma:
      - no-cache
      Content-Length:
      - '1317'
      Content-Type:
      - application/json
      Server:
      - Microsoft-IIS/8.5
      X-Content-Type-Options:
      - nosniff
      Date:
      - Fri, 13 Nov 2015 14:23:33 GMT
      Connection:
      - close
    body:
      encoding: UTF-8
      string: '{"token_type":"bearer","expires_in":3600,"scope":"bingads.manage","access_token":"bing-ads-oauth-authentication-token","refresh_token":"bing-ads-oauth-refresh-token","user_id":"bing-ads-oauth-user-id"}'
    http_version: 
  recorded_at: Fri, 13 Nov 2015 14:23:34 GMT
- request:
    method: post
    uri: https://reporting.api.bingads.microsoft.com/Api/Advertiser/Reporting/V9/ReportingService.svc
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                      xmlns:tns="https://bingads.microsoft.com/Reporting/v9"
                      xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
                      xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
            <env:Header>
                <tns:CustomerAccountId>bing-ads-account-id</tns:CustomerAccountId>
                <tns:CustomerId>bing-ads-customer-id</tns:CustomerId>
                <tns:DeveloperToken>bing-ads-developer-token</tns:DeveloperToken>
                <tns:AuthenticationToken>bing-ads-oauth-authentication-token</tns:AuthenticationToken>
            </env:Header>
            <env:Body>
                <tns:SubmitGenerateReportRequest>
                    <tns:ReportRequest xmlns:i="http://www.w3.org/2001/XMLSchema-instance" i:type="tns:CampaignPerformanceReportRequest">
                        <tns:Format>Csv</tns:Format>
                        <tns:Language>English</tns:Language>
                        <tns:ReportName>MyReport</tns:ReportName>
                        <tns:ReturnOnlyCompleteData>false</tns:ReturnOnlyCompleteData>
                        <tns:Aggregation>HourOfDay</tns:Aggregation>
                        <tns:Columns>
                                <tns:CampaignPerformanceReportColumn>TimePeriod</tns:CampaignPerformanceReportColumn>
                                <tns:CampaignPerformanceReportColumn>Impressions</tns:CampaignPerformanceReportColumn>
                                <tns:CampaignPerformanceReportColumn>Clicks</tns:CampaignPerformanceReportColumn>
                                <tns:CampaignPerformanceReportColumn>Spend</tns:CampaignPerformanceReportColumn>
                        </tns:Columns>
                        <tns:Scope>
                            <tns:AccountIds>
                                <arr:long>bing-ads-account-id</arr:long>
                            </tns:AccountIds>
                        </tns:Scope>
                        <tns:Time>
                            <tns:CustomDateRangeEnd>
                                <tns:Day>14</tns:Day>
                                <tns:Month>10</tns:Month>
                                <tns:Year>2015</tns:Year>
                            </tns:CustomDateRangeEnd>
                            <tns:CustomDateRangeStart>
                                <tns:Day>14</tns:Day>
                                <tns:Month>10</tns:Month>
                                <tns:Year>2015</tns:Year>
                            </tns:CustomDateRangeStart>
                        </tns:Time>
                    </tns:ReportRequest>
                </tns:SubmitGenerateReportRequest>
            </env:Body>
        </env:Envelope>
    headers:
      Content-Type:
      - text/xml;charset=UTF-8
      Soapaction:
      - SubmitGenerateReport
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Length:
      - '396'
      Content-Type:
      - text/xml; charset=utf-8
      Server:
      - Microsoft-IIS/8.0
      X-Powered-By:
      - ASP.NET
      Date:
      - Fri, 13 Nov 2015 14:23:35 GMT
    body:
      encoding: UTF-8
      string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><h:TrackingId
        xmlns:h="https://bingads.microsoft.com/Reporting/v9">bing-ads-report-tracking-id</h:TrackingId></s:Header><s:Body><SubmitGenerateReportResponse
        xmlns="https://bingads.microsoft.com/Reporting/v9"><ReportRequestId>bing-ads-report-request-id</ReportRequestId></SubmitGenerateReportResponse></s:Body></s:Envelope>
    http_version: 
  recorded_at: Fri, 13 Nov 2015 14:23:35 GMT
- request:
    method: post
    uri: https://reporting.api.bingads.microsoft.com/Api/Advertiser/Reporting/V9/ReportingService.svc
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                      xmlns:tns="https://bingads.microsoft.com/Reporting/v9"
                      xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
                      xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
            <env:Header>
                <tns:CustomerAccountId>bing-ads-account-id</tns:CustomerAccountId>
                <tns:CustomerId>bing-ads-customer-id</tns:CustomerId>
                <tns:DeveloperToken>bing-ads-developer-token</tns:DeveloperToken>
                <tns:AuthenticationToken>bing-ads-oauth-authentication-token</tns:AuthenticationToken>
            </env:Header>
            <env:Body>
                <tns:PollGenerateReportRequest>
                    <tns:ReportRequestId xsi:nil="false">bing-ads-report-request-id</tns:ReportRequestId>
                </tns:PollGenerateReportRequest>
            </env:Body>
        </env:Envelope>
    headers:
      Content-Type:
      - text/xml;charset=UTF-8
      Soapaction:
      - PollGenerateReport
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Length:
      - '493'
      Content-Type:
      - text/xml; charset=utf-8
      Server:
      - Microsoft-IIS/8.0
      X-Powered-By:
      - ASP.NET
      Date:
      - Fri, 13 Nov 2015 14:23:36 GMT
    body:
      encoding: UTF-8
      string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><h:TrackingId
        xmlns:h="https://bingads.microsoft.com/Reporting/v9">bing-ads-report-tracking-id</h:TrackingId></s:Header><s:Body><PollGenerateReportResponse
        xmlns="https://bingads.microsoft.com/Reporting/v9"><ReportRequestStatus xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><ReportDownloadUrl
        i:nil="true"/><Status>Pending</Status></ReportRequestStatus></PollGenerateReportResponse></s:Body></s:Envelope>
    http_version: 
  recorded_at: Fri, 13 Nov 2015 14:23:36 GMT
- request:
    method: post
    uri: https://reporting.api.bingads.microsoft.com/Api/Advertiser/Reporting/V9/ReportingService.svc
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                      xmlns:tns="https://bingads.microsoft.com/Reporting/v9"
                      xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
                      xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
            <env:Header>
                <tns:CustomerAccountId>bing-ads-account-id</tns:CustomerAccountId>
                <tns:CustomerId>bing-ads-customer-id</tns:CustomerId>
                <tns:DeveloperToken>bing-ads-developer-token</tns:DeveloperToken>
                <tns:AuthenticationToken>bing-ads-oauth-authentication-token</tns:AuthenticationToken>
            </env:Header>
            <env:Body>
                <tns:PollGenerateReportRequest>
                    <tns:ReportRequestId xsi:nil="false">bing-ads-report-request-id</tns:ReportRequestId>
                </tns:PollGenerateReportRequest>
            </env:Body>
        </env:Envelope>
    headers:
      Content-Type:
      - text/xml;charset=UTF-8
      Soapaction:
      - PollGenerateReport
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Length:
      - '937'
      Content-Type:
      - text/xml; charset=utf-8
      Server:
      - Microsoft-IIS/8.0
      X-Powered-By:
      - ASP.NET
      Date:
      - Fri, 13 Nov 2015 14:23:42 GMT
    body:
      encoding: UTF-8
      string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><h:TrackingId
        xmlns:h="https://bingads.microsoft.com/Reporting/v9">bing-ads-report-tracking-id</h:TrackingId></s:Header><s:Body><PollGenerateReportResponse
        xmlns="https://bingads.microsoft.com/Reporting/v9"><ReportRequestStatus xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><ReportDownloadUrl>https://download.api.bingads.microsoft.com/ReportDownload/Download.aspx?q=bing-ads-report-download-id</ReportDownloadUrl><Status>Success</Status></ReportRequestStatus></PollGenerateReportResponse></s:Body></s:Envelope>
    http_version: 
  recorded_at: Fri, 13 Nov 2015 14:23:42 GMT
- request:
    method: get
    uri: https://download.api.bingads.microsoft.com/ReportDownload/Download.aspx?q=bing-ads-report-download-id
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Length:
      - '875'
      Content-Type:
      - application/x-zip-compressed
      Server:
      - Microsoft-IIS/8.0
      Content-Disposition:
      - attachment; filename="MyReport.zip"
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Fri, 13 Nov 2015 14:23:43 GMT
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        UEsDBBQAAAAIAPCYb0c2Z8CWHQIAAPkDAAAUAE8AMzAwMDAwMDYyNjA5ODY2
        Ny5jc3ZOVS4ATlVDWBQAMwAwADAAMAAwADAAMAA2ADIANgAwADkAOAA2ADYA
        NwAuAGMAcwB2AHVwGQABF2t/LTMwMDAwMDA2MjYwOTg2NjcuY3N2hFNLjtQw
        EN0jcQcrK5CQ21X+JrvWIGAkGhCMWLAL3e4mIt1uJelBvUNwC24wZ2CBxNyE
        C3AFXOWMxAoWieP3/F69sp3f339Ur+MxDZN40e5jI1bnMq3u37sjrjoiQC3A
        LFCBJYow8S4dMvG2Hbp0Ggl93o6TuEj7Yx+nuBHL67br2/d9FI/bc3aABTh2
        ENgY1Sgllivx4Onq6uE/xc/Safives663O2GuGunLh0aFoq0FZv2/NeSJ10/
        xWxI0Ks0xcPUtb24PKzn0jns1DZiGk6RVenT2Ag0+TvPyPLlNrdTPaou98ch
        jmMuNebZRd+tP9LHm2M8bEip8kT7WucBbF3nwaN0vH1AlHW0AgwS5azUgSgk
        CrwnCr3Ng/WyRqLICaE2eQiGRDpIxyKCQHMpq8kcjQSKXJGBd5Yh9gSpPBGO
        9CWcIYWTWZhxXmQphWWVNI7gQEVJg4SCBE5EIYBQepREdgY1A5pB0AzCDCKD
        qmaQmyUUAsNBMcypgHsPnMFyl0BtektvrZGTy1CMaG2tiTH8hlq6Upfdy35a
        zo76jir7gYUKhZoTBKYUU4q6RJShhOCeMXA/XBe99Nw48nl6FvvAB2Sl5e3D
        ciieU2PxNRI5B5ZdKLfB8UqvpSq3QfMxG96R0rqvpZ1v4+3XX5+/3X75ecO/
        xapbD2lMW/qLhnzV+S+QYtn3Yuh2H6ZR5Osah+u4kaL6AwAA//8DAFBLAQIt
        ABQAAAAIAPCYb0c2Z8CWHQIAAPkDAAAUAHUAAAAAAAAAAAAAAAAAAAAzMDAw
        MDAwNjI2MDk4NjY3LmNzdk5VMABOVUNYFAAAADMAMAAwADAAMAAwADAANgAy
        ADYAMAA5ADgANgA2ADcALgBjAHMAdgAKACAAAAAAAAEAGAD8qUTvGyDRAfyp
        RO8bINEBN3BD7xsg0QF1cBkAARdrfy0zMDAwMDAwNjI2MDk4NjY3LmNzdlBL
        BQYAAAAAAQABALcAAACeAgAAAAA=
    http_version: 
  recorded_at: Fri, 13 Nov 2015 14:23:43 GMT
recorded_with: VCR 3.0.0
